todolist/app/controllers/todolist_charts_controller.rb

SELECT * FROM `todolist_charts`
---
  def index
    @todolist_charts = TodolistChart.all

SELECT * FROM `todolist_charts` WHERE (`todolist_charts`.`status` = 'completed')
DELETE FROM `todolist_charts` WHERE `id` = 1
---
 def delete_complete
    @todolist_chart = TodolistChart.find(:all, :conditions => {:status => "completed"})

    @todolist_chart.each do |todolist_chart|
      todolist_chart.destroy

SELECT * FROM `todolist_charts` WHERE (`todolist_charts`.`id` = 1)
---
  def show
    @todolist_chart = TodolistChart.find(params[:id])

SELECT * FROM `todolist_charts` WHERE (`todolist_charts`.`id` = 1)
---
  def edit
    @todolist_chart = TodolistChart.find(params[:id])

INSERT INTO `todolist_charts` (`name`, `status`, `updated_at`, `priority`, `description`, `duedate`, `created_at`) VALUES('task1', 'pending', '2009-12-12 03:54:44', 'high', 'cit-597 assignment', '2009-12-12', '2009-12-12 03:54:44')
---
  def create
    @todolist_chart = TodolistChart.new(params[:todolist_chart])

    respond_to do |format|
      if @todolist_chart.save

SELECT * FROM `todolist_charts` WHERE (`todolist_charts`.`id` = 1)
UPDATE `todolist_charts` SET `priority` = 'very high', `description` = 'network systems final', `updated_at` = '2009-12-13 23:33:42' WHERE `id` = 31
---
  def update
    @todolist_chart = TodolistChart.find(params[:id])

    respond_to do |format|
      if @todolist_chart.update_attributes(params[:todolist_chart])

SELECT * FROM `todolist_charts` WHERE (`todolist_charts`.`id` = 1)
UPDATE `todolist_charts` SET `status` = 'completed', `updated_at` = '2009-12-12 20:22:24' WHERE `id` = 1
---
       def mark_complete
       @todolist_chart = TodolistChart.find(params[:id])

       new = {:status => "completed"}
       @todolist_chart.update_attributes(new)

SELECT * FROM `todolist_charts` WHERE (`todolist_charts`.`id` = 2)
DELETE FROM `todolist_charts` WHERE `id` = 2
---
  def destroy
    @todolist_chart = TodolistChart.find(params[:id])
    @todolist_chart.destroy